// pages/about/help/problemDetail/problemDetail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    problemArr: [
      {
        name: '1.查无此票',
        reason: [
          '(1).发票四要素（注：发票代码、发票号码、开票日期、不含税金额[专票类的第四要素]、校验码后六位[普票类的第四要素]）有误。\n' +
          '注：专票类增值税发票有：增值税专用发票、增值税电子专用发票、机动车销售统一发票、货运运输业增值税专用发票、二手车销售统一发票。\n' +
          '普票类增值税发票有：增值税普通发票、增值税电子发票、增值税普通发票(卷式)、通行费发票。',
          '(2).发票为当天开具，发票数据尚未上传到税局底账。',
          '(3).此发票确实不存在为假票'
        ],
        solution: [
          '核对修改发票四要素，重新发起发票查验。',
          '次日再发起发票查验。',
          '删除发票信息。'
        ],
      },
      {
        name: '2.查验发票信息不一致',
        reason: [
          '(1).输入的发票四要素（注：发票代码、发票号码、开票日期、不含税金额[专票类的第四要素]、校验码后六位[普票类的第四要素]）有误。',
          '(2).发票图片模糊或者图片中发票有褶皱导致发票四要素ocr识别有误。',
          '(3).百望发票校验码被盖章遮挡模糊orc难以识别。'
        ],
        solution: [
          '核对修改发票四要素，重新发起发票查验。',
          '重拍清晰准确发票图片再上传查验。',
          'ocr识别发票要素后，人工参与修改校正再上传查验。'
        ],
      },
      {
        name: '3.该张发票超出当天查验次数',
        reason: ['(1).税局底账限定每张发票每张只能查验5次。'],
        solution: ['次日再发起发票查验。'],
      },
      {
        name: '4.超过5年的发票无法查验',
        reason: ['(1).税局仅支持可查验最近5年内增值税发票管理系统开具的发票。'],
        solution: ['确认发票开具日期，如已超过五年可删除该发票。']
      },
      {
        name: '5.查验通道无响应，请稍后再试',
        reason: ['(1).税局底账系统繁忙。'],
        solution: ['等待一段时间后再发起发票查验。'],
      },
      {
        name: '6.查验通道错误、查验异常',
        reason: ['(1).税局底账系统接口阻塞。'],
        solution: ['等待一段时间后再发起发票查验。']
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})